content/posts/laravel/_index.md
+++
title = "Exploring Laravel"
author = ["R_Hasan"]
date = 2022-08-16
draft = false
+++

## Preface {#preface}

Ahh! I met a client who was asking me to do an IoT project, but in laravel specifically. I was in need of money that time but I missed the client as I couldn't manage myself to confidently tell him I was an Laravel expert that he was looking for.

This is going to be my self exploring laravel journey that may help me to become a Laravel friendly developer, and perhaps no client would be missed again.


## Introduction {#introduction}

This is my first attempt to learn laravel


### Chapter 1 {#chapter-1}


#### Reading List {#_index}

In this chapter we have to overlook some of the following properties.


#### Reading List 2 {#_index2}

In this chapter we have to overlook some of the following properties.
